import pandas as pd

def bar_chart(data_with_tags): 
    df = pd.DataFrame(data_with_tags)
    print(df)

if __name__ == "__main__":
    print("bar_chart.py is running")
    data = [
    {
        "text": "в терияки бургере было очеень много соуса,из за чего он весь промок и руки были очень грязными😐😔",
        "date_created": "2026-01-15T21:49:53.096762+07:00",
        "tags": [
            "Food Quality",
            "Cleanliness"
        ]
    },
    {
        "text": "В целом делюкс бокс, бургер большой неплох, а вот фри и стрипсы уже охладились и не очень получились, поэтому двойка",
        "date_created": "2026-01-14T15:33:48.081239+07:00",
        "tags": [
            "Food Quality"
        ]
    },
    {
        "text": "Уф можете быстрее открыться пока я школу не закончила",
        "date_created": "2025-12-29T14:50:01.079636+07:00",
        "tags": [
            "Service"
        ]
    },
    {
        "text": "кашан ашыласындар джиги",
        "date_created": "2025-12-28T23:06:28.391301+07:00",
        "tags": [
            "Service"
        ]
    }
]
    bar_chart(data)